<template>
  <div>
    <div class="time-axios-history">
      <h3>时间历程轮播组件</h3>
      <div class="time-axios-history-main">
        <base-time-axios-history :dataMap="datamap" />
      </div>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      datamap: {
        '1997-09-01': [
          {
            date: '1997-09-01',
            text: '企业成立：',
            detail: '企业成立'
          }
        ],
        '2001-07-04': [
          {
            date: '2001-07-04',
            text: '首个专利授权：',
            detail: '获得发明专利授权：一种中药贴膏及其制造方法'
          }
        ],
        '2005-04-25': [
          {
            date: '2005-04-25',
            text: '首次设立分公司：',
            detail:
              '在广东省广州市设立首家分支机构：广州白云山医药集团股份有限公司白云山化学药创新中心'
          }
        ],
        '2000-12-06': [
          {
            date: '2000-12-06',
            text: '首个专利申请：',
            detail: '申请发明专利：一种头孢抗菌组合物'
          }
        ],
        '2017-06-27': [
          {
            date: '2017-06-27',
            text: '企业注册资本变更：',
            detail: '注册资本由129134.065万人民币增资为162579.0949万人民币'
          }
        ],
        '2001-01-17': [
          {
            date: '2001-01-17',
            text: '企业注册资本变更：',
            detail: '注册资本由73290万人民币增资为81090万人民币'
          }
        ],
        '2015-03-10': [
          {
            date: '2015-03-10',
            text: '首次涉诉：',
            detail:
              '上诉人王健仪因损害公司利益责任纠纷一案，不服广州市越秀区人民法院驳回其管辖权异议申请的（2014）穗越法民四初字第100号民事裁定，向本院提起上诉'
          }
        ],
        '1997-12-31': [
          {
            date: '1997-12-31',
            text: '企业注册资本变更：',
            detail: '注册资本由51300万人民币增资为73290万人民币'
          }
        ],
        '1997-10-30': [
          {
            date: '1997-10-30',
            text: '企业上市：',
            detail: '港股上市，代码：0874.HK'
          }
        ],
        '2014-10-10': [
          {
            date: '2014-10-10',
            text: '获评高新技术企业：',
            detail: '获得广东省高新技术企业认定备案'
          }
        ],
        '2013-07-09': [
          {
            date: '2013-07-09',
            text: '企业更名：',
            detail:
              '企业名称由“广州药业股份有限公司”变更为“广州白云山医药集团股份有限公司”'
          },
          {
            date: '2013-07-09',
            text: '企业注册资本变更：',
            detail: '注册资本由81090万人民币增资为129134.065万人民币'
          }
        ],
        '2001-02-06': [
          {
            date: '2001-02-06',
            text: '企业上市：',
            detail: 'A股上市，代码：600332.SH'
          }
        ]
      }
    };
  },
  created() {},
  methods: {}
};
</script>
